src/cf/InformationRegisters/CertificatesOfReportDistributionRecipients.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>CertificatesOfReportDistributionRecipients</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>CertificateToEncrypt</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DigitalSignatureAndEncryptionKeysCertificates</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>BulkEmailRecipient</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.BulkEmailRecipient</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CertificatesOfReportDistributionRecipients/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

// For internal use.
// 
Procedure SaveCertificateForDistributionRecipient(BulkEmailRecipient, CertificateToEncrypt) Export
	SetPrivilegedMode(True);
	
	BeginTransaction();
	Try
		Block = New DataLock();
		LockItem = Block.Add("InformationRegister.CertificatesOfReportDistributionRecipients");
		LockItem.SetValue("BulkEmailRecipient", BulkEmailRecipient);
		Block.Lock();
		
		RecordManager = CreateRecordManager();
		RecordManager.BulkEmailRecipient= BulkEmailRecipient;
		RecordManager.Read();
		
		RecordManager.BulkEmailRecipient = BulkEmailRecipient;
		RecordManager.CertificateToEncrypt = CertificateToEncrypt;

		RecordManager.Write(True);
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
EndProcedure

#EndRegion

#EndIf
